{
    "1969": [
        "II Bienal del Ikporte en lasBellas Artes, Palacio del Retiro, Madrid.",
        "VIII Premi Dibuix Joan Miró, Barcelona",
        "XIII Salón de Mayo, Barcelona.",
        "X Salón de Marzo, Museo Histórico, Valencia.",
        "XI Concurso Internacional Dibujo Inglada-Guillot, Palacio Virreina."
    ],
    "1970": [
        "IX Premi Dibuix Joan Miró, Barcelona.",
        "\"Situazioni 70\", Galería AL 2, Roma. Italia.",
        "Selección Premi Joan Miró, Miami Center e itinerante en EE.UU",
        "XI Salón de Marzo, Museo Histórico, Valencia.",
        "Selección X Salón de Marzo, Alicante.",
        "XII Concurso Dibujo Inglada-Guillot, Palacio Virreina, Barcelona.",
        "Pintores Arte Actual, Círculo Bellas Artes, Valencia."
    ],
    "1971": [
        "X Premi Dibuix Joan Miró, Barcelona.",
        "Selección X Premi Miro, Girona.",
        "III Bienal Deporte en las Bellas Artes en las Bellas Artes, reales Atarazanas, Barcelona.",
        "I Premio Nacional de Dibujo Pancho Cossio, León.",
        "Homenaje a Pablo Picasso, Galería Machado, Madrid.",
        "XII Salón de Marzo, Museo Histórico, Valencia."
    ],
    "1972": [
        "II Bienal de Pintura, Zaragoza.",
        "Homenaje a Picasso, Vallauris, Francia.",
        "II Premio Nacional Dibujo Pancho Cossio, León.",
        "Homenaje Internacional a Bertand Russell, XI Premi Dibuix Miró, Barcelona.",
        "XIV Concurso InternEional Pal. Virreina, Barcelona-"
    ],
    "1973": [
        "VI Bienal Pintura \"Premio Zaragoza\" la Lonja. Zaragoza.",
        "Bienal Pintura, Sala Prwincia IV Bienal Deprte en las Bellas Artes, Palacio de Cristal, Madrid.",
        "XIII Salón Marzo, Museo Histórico, Valencia.",
        "Nuevos Maestros de la Pintura Española, Museo Arte Contemporáneo, Madrid.",
        "Obras seleccionadas Premi Miró, Galería Juana de Aizpure, Sevilla."
    ],
    "1974": [
        "Mostra de Arte Realitat, Colegio de Aparejadores, Barcelona.",
        "Selección XIII Premi Joan Miró, Munich, Alemania.",
        "IV Premio Dibujo Pancho Cossio, León.",
        "I Premio Nacional \"Adaja\", Ávila."
    ],
    "1975": [
        "Inauguración Galería Vinuesa \"4 Pintores\", Soria."
    ],
    "1976": [
        "Homenaje de los Pueblos de España a Miguel Hernández, Itinerante.",
        "Homenaje a Rafael Alberti, Galería Ciento, Barcelona."
    ],
    "1977": [
        "Pintura Española Contemporánea, Casa de las Américas, La Habana, Cuba.",
        "Pintura Española Contemporánea, Lisboa. Portugal."
    ],
    "1978": [
        "Siete Artistas de Soria, Sala Cultural C.A., Pamplona.",
        "Pintores Contemporáneos, organizada por la UNESCO y Consejo de Europa, Burgos."
    ]
}